# --- СЛОВАРЬ ЛОКАЛИЗАЦИИ ---
RUtexts = {
    "RU": {
        "hello_user": "Здравствуйте, {name}! Выберите действие:",
        "welcome_lang_choice": "Здравствуйте, выберите язык\nHello, choose a language",
        "record_laundry": "Записаться на стирку",
        "show_records": "Показать мои записи",
        "cancel_record": "Отменить запись",
        "report_in_admin": "Сообщить о проблеме",
        "exit": "Выйти",
        "back": "Назад",
        "machine_type": "Машина",
        # Запись
        "record_start": "Выберите дату",
        "slots_none": "На {date} нет свободных слотов",
        "time_prompt": "Выберите время на {date}:",
        "machines_none": "Упс! Все машины заняты в это время.",
        "machine_prompt": "Выберите стиральную машину на {datetime}:",
        "booking_success": "Запись создана!\nМашина №{machine_num}\n{start} – {end}",
        "booking_error": "Слот уже занят другим пользователем!",
        # Аунтификация
        "none_user": "Данные не найдены в системе. Обратитесь к администратору.",
        "reg_id_error": "Пожалуйста, введите только цифры.",
        "other_tg_id": "Этот пользователь уже зарегистрирован с другого аккаунта.",
        "seek_cards": "Пользователь с таким ФИО не найден. Введите номер вашей зачетной книжки (только цифры)",
        "auth": "Введите ФИО (Фамилия Имя Отчество) для авторизации",
        "write_FIO": "Пожалуйста, введите полное ФИО (минимум 2 слова).",
    }
}