# --- СЛОВАРЬ ЛОКАЛИЗАЦИИ ---
RUtexts = {
    "RU": {
        "hello_user": "Здравствуйте, {name}! Выберите действие:",
        "welcome_lang_choice": "Здравствуйте, выберите язык\nHello, choose a language",
        "record_laundry": "Записаться на стирку",
        "show_records": "Показать мои записи",
        "cancel_record": "Отменить запись",
        "exit": "Выйти",
        "back": "Назад",
        "machine_type": "Машина",
        # Регистрация
        "reg_start": "Здравствуйте! Давайте зарегистрируемся.\n\nВведите ваши <b>ФИО</b> через пробел:\n<i>Пример: Иванов Иван Иванович</i>",
        "reg_fio_error": "Пожалуйста, введите Фамилию, Имя и Отчество через пробел.",
        "reg_room_prompt": "Принято! Теперь введите <b>номер комнаты</b> (только цифры):",
        "reg_room_error": "Номер комнаты должен быть числом.",
        "reg_id_prompt": "Введите <b>номер зачетной книжки</b>:",
        "reg_id_error": "Номер зачетки должен быть числом.",
        "reg_success": "Регистрация успешна! Добро пожаловать.",
        "reg_db_error": "Ошибка при сохранении: ",
        # Запись
        "record_start": "Выберите дату (функция в разработке)",
        "slots_none": "На {date} нет свободных слотов",
        "time_prompt": "Выберите время на {date}:",
        "machines_none": "Упс! Все машины заняты в это время.",
        "machine_prompt": "Выберите стиральную машину на {datetime}:",
        "booking_success": "Запись создана!\nМашина №{machine_num}\n{start} – {end}",
        "booking_error": "Слот уже занят другим пользователем!",
    }
}